; domain
(define (domain minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :conditional-effects :existential-preconditions :constraints :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 ball box - object_
 )
 (:constants
   empty - empty_0
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (increase (total-cost) 1)))
)

; problem
(define (problem minigrid-problem)
 (:domain minigrid-domain)
 (:objects
   room_1 room_2 room_3 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   green_door_1 yellow_door_1 grey_door_1 yellow_door_2 - door
   red_ball_1 grey_ball_2 grey_ball_1 blue_ball_1 - ball
   grey_box_1 yellow_box_1 purple_box_1 blue_box_1 - box
 )
 (:init (agentinroom room_2) (objectinroom blue_box_1 room_1) (objectinroom red_ball_1 room_1) (objectinroom blue_ball_1 room_2) (objectinroom yellow_box_1 room_2) (objectinroom grey_box_1 room_3) (objectinroom purple_box_1 room_3) (objectinroom grey_ball_1 room_3) (objectinroom grey_ball_2 room_4) (objectcolor blue_box_1 bluetype) (objectcolor red_ball_1 redtype) (objectcolor blue_ball_1 bluetype) (objectcolor yellow_box_1 yellowtype) (objectcolor grey_box_1 greytype) (objectcolor purple_box_1 purpletype) (objectcolor grey_ball_1 greytype) (objectcolor grey_ball_2 greytype) (objectcolor green_door_1 greentype) (objectcolor yellow_door_1 yellowtype) (objectcolor grey_door_1 greytype) (objectcolor yellow_door_2 yellowtype) (emptyhands) (locked green_door_1) (locked yellow_door_1) (locked grey_door_1) (locked yellow_door_2) (adjacentrooms room_2 room_1 green_door_1) (adjacentrooms room_1 room_2 green_door_1) (adjacentrooms room_3 room_1 yellow_door_1) (adjacentrooms room_1 room_3 yellow_door_1) (adjacentrooms room_4 room_2 grey_door_1) (adjacentrooms room_2 room_4 grey_door_1) (adjacentrooms room_4 room_3 yellow_door_2) (adjacentrooms room_3 room_4 yellow_door_2) (visited room_2) (= (total-cost) 0))
 (:goal (and (exists (?v - ball)
 (and (objectcolor ?v greytype) (objectinroom ?v room_4) (agentinroom room_4) (at_ ?v)))))
 (:constraints (sometime (and (carrying blue_box_1) (objectinroom red_ball_1 room_4))) (sometime (or (at_ blue_ball_1) (not (locked yellow_door_1)))) (sometime (or (not (emptyhands)) (at_ purple_box_1))) (sometime (locked grey_door_1)) (sometime-after (locked grey_door_1) (objectinroom yellow_box_1 room_3)) (sometime (carrying grey_ball_1)) (sometime (agentinroom room_4)) (sometime-before (agentinroom room_4) (or (objectinroom blue_box_1 room_3) (at_ yellow_door_1))) (sometime (agentinroom room_2)) (sometime-after (agentinroom room_2) (not (locked yellow_door_2))))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor green_door_1 room_2 room_1)
   added: (at_ green_door_1)
   goals met: 0 of 1
2. (toggle green_door_1)
   deleted: (locked green_door_1)
   goals met: 0 of 1
3. (gotoobject yellow_box_1 room_2)
   deleted: (at_ green_door_1)
   added: (at_ yellow_box_1)
   goals met: 0 of 1
4. (pick yellow_box_1 room_2)
   deleted: (at_ yellow_box_1) (emptyhands) (objectinroom yellow_box_1 room_2)
   added: (carrying yellow_box_1)
   goals met: 0 of 1
5. (gotoroom room_2 room_1 green_door_1)
   deleted: (agentinroom room_2)
   added: (agentinroom room_1) (visited room_1)
   goals met: 0 of 1
6. (gotodoor yellow_door_1 room_1 room_3)
   added: (at_ yellow_door_1)
   goals met: 0 of 1
7. (toggle yellow_door_1)
   deleted: (locked yellow_door_1)
   goals met: 0 of 1
8. (gotoroom room_1 room_3 yellow_door_1)
   deleted: (agentinroom room_1) (at_ yellow_door_1)
   added: (agentinroom room_3) (visited room_3)
   goals met: 0 of 1
9. (gotodoor yellow_door_2 room_3 room_4)
   added: (at_ yellow_door_2)
   goals met: 0 of 1
10. (toggle yellow_door_2)
   deleted: (locked yellow_door_2)
   goals met: 0 of 1
11. (gotoempty)
   deleted: (at_ yellow_door_2)
   added: (at_ empty)
   goals met: 0 of 1
12. (drop yellow_box_1 room_3)
   deleted: (carrying yellow_box_1) (at_ empty)
   added: (at_ yellow_box_1) (emptyhands) (objectinroom yellow_box_1 room_3)
   goals met: 0 of 1
13. (gotoroom room_3 room_1 yellow_door_1)
   deleted: (agentinroom room_3) (at_ yellow_box_1)
   added: (agentinroom room_1)
   goals met: 0 of 1
14. (gotoobject red_ball_1 room_1)
   added: (at_ red_ball_1)
   goals met: 0 of 1
15. (pick red_ball_1 room_1)
   deleted: (at_ red_ball_1) (emptyhands) (objectinroom red_ball_1 room_1)
   added: (carrying red_ball_1)
   goals met: 0 of 1
16. (gotoroom room_1 room_3 yellow_door_1)
   deleted: (agentinroom room_1)
   added: (agentinroom room_3)
   goals met: 0 of 1
17. (gotoroom room_3 room_4 yellow_door_2)
   deleted: (agentinroom room_3)
   added: (agentinroom room_4) (visited room_4)
   goals met: 0 of 1
18. (gotoempty)
   added: (at_ empty)
   goals met: 0 of 1
19. (drop red_ball_1 room_4)
   deleted: (carrying red_ball_1) (at_ empty)
   added: (at_ red_ball_1) (emptyhands) (objectinroom red_ball_1 room_4)
   goals met: 0 of 1
20. (gotoroom room_4 room_3 yellow_door_2)
   deleted: (agentinroom room_4) (at_ red_ball_1)
   added: (agentinroom room_3)
   goals met: 0 of 1
21. (gotoobject grey_ball_1 room_3)
   added: (at_ grey_ball_1)
   goals met: 0 of 1
22. (pick grey_ball_1 room_3)
   deleted: (at_ grey_ball_1) (emptyhands) (objectinroom grey_ball_1 room_3)
   added: (carrying grey_ball_1)
   goals met: 0 of 1
23. (gotoroom room_3 room_1 yellow_door_1)
   deleted: (agentinroom room_3)
   added: (agentinroom room_1)
   goals met: 0 of 1
24. (gotoempty)
   added: (at_ empty)
   goals met: 0 of 1
25. (drop grey_ball_1 room_1)
   deleted: (carrying grey_ball_1) (at_ empty)
   added: (at_ grey_ball_1) (emptyhands) (objectinroom grey_ball_1 room_1)
   goals met: 0 of 1
26. (gotoobject blue_box_1 room_1)
   deleted: (at_ grey_ball_1)
   added: (at_ blue_box_1)
   goals met: 0 of 1
27. (pick blue_box_1 room_1)
   deleted: (at_ blue_box_1) (emptyhands) (objectinroom blue_box_1 room_1)
   added: (carrying blue_box_1)
   goals met: 0 of 1
28. (gotoroom room_1 room_3 yellow_door_1)
   deleted: (agentinroom room_1)
   added: (agentinroom room_3)
   goals met: 0 of 1
29. (gotoroom room_3 room_4 yellow_door_2)
   deleted: (agentinroom room_3)
   added: (agentinroom room_4)
   goals met: 0 of 1
30. (gotoobject grey_ball_2 room_4)
   added: (at_ grey_ball_2)
   goals met: 1 of 1
